
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/YumNumm/rx2530-infra/actions/runs/15774734106)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
lxd_instance.network: Refreshing state... [name=network]
lxd_instance.win11: Refreshing state... [name=win11]
lxd_instance.media: Refreshing state... [name=media]
lxd_instance.docker_registry: Refreshing state... [name=docker-registry]
lxd_instance.sandbox: Refreshing state... [name=sandbox]
lxd_instance.eqmonitor: Refreshing state... [name=eqmonitor]
lxd_instance.monitor: Refreshing state... [name=monitor]
lxd_instance.tv: Refreshing state... [name=tv]
lxd_instance.packer_lxd: Refreshing state... [name=packer-lxd]
lxd_instance.github_actions_runner: Refreshing state... [name=github-actions-runner]
lxd_project.default: Refreshing state... [name=default]
lxd_instance.ubuntu_desktop: Refreshing state... [name=ubuntu-desktop]
lxd_instance.loki: Refreshing state... [name=loki]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # lxd_instance.common will be created
  + resource "lxd_instance" "common" {
      + allow_restart    = false
      + config           = {
          + "cloud-init.user-data" = <<-EOT
                #cloud-config
                
                apt:
                  sources:
                    fish-shell:
                      source: ppa:fish-shell/release-4
                
                package_update: true
                package_upgrade: true
                
                packages:
                  - curl
                  - wget
                  - git
                  - htop
                  - unzip
                  - software-properties-common
                  - apt-transport-https
                  - ca-certificates
                  - gnupg
                  - lsb-release
                  - language-pack-ja-base
                  - language-pack-ja
                  - fish
                
                timezone: Asia/Tokyo
                locale: ja_JP.UTF-8
                
                users:
                  - name: yumnumm
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh_import_id: github:yumnumm
                
                runcmd:
                  # install fisher
                  - >-
                    sudo -H -u yumnumm fish -c
                      "curl -sL https://raw.githubusercontent.com/jorgebucaran/fisher/main/functions/fisher.fish | source &&
                      fisher install jorgebucaran/fisher"
                  # install fisher plugin: tide
                  - >-
                    sudo -H -u yumnumm fish -c
                      "fisher install IlanCosman/tide@v6"
                
                final_message: "Cloud-init setup completed successfully"
            EOT
          + "raw.idmap"            = "both 1000 1000"
          + "security.nesting"     = "true"
        }
      + description      = "Common instance with basic setup"
      + ephemeral        = false
      + image            = "ubuntu:24.04"
      + interfaces       = (known after apply)
      + ipv4_address     = (known after apply)
      + ipv6_address     = (known after apply)
      + limits           = {
          + "cpu"    = "4"
          + "memory" = "4GiB"
        }
      + location         = (known after apply)
      + mac_address      = (known after apply)
      + name             = "common"
      + profiles         = [
          + "default",
        ]
      + running          = true
      + status           = (known after apply)
      + type             = "container"
      + wait_for_network = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.
lxd_instance.common: Creating...
lxd_instance.common: Creation complete after 9s [name=common]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":12,"Program":"tfcmt","SHA1":"e3c8143f4163fef31a479b9fe4babe926705fea2","Vars":{},"WorkflowName":"Terraform Apply"} -->